function F=fun2(x)
r11=x(1);
r12=x(2);
r13=x(3);
r21=x(4);
r22=x(5);
r23=x(6);
r31=x(7);
r32=x(8);
r33=x(9);
t1=x(10);
t2=x(11);
t3=x(12);


 n1=[0;0.62260056;0.78253980];                   %初始位置光平面1法向量
 n2=[-0.73091659;0.00284625;-0.68246087];	 %初始位置光平面2法向量
 d=1.13085689;
 

x0=[0;0;0];
x1=[-5.637346;97.293991;184.52958];
x2=[83.872458;79.44437;308.470164];
x3=[-110.227859;-44.626329;550.671631];
x4=[-62.879544;-199.383353;265.965473];
x5=[-104.838603;-106.260285;149.351819];   %各点坐标


 R=[r11 r12 r13;r21 r22 r23;r31 r32 r33];
 T=[t1; t2; t3];
 xw0=R*x0+T;
 xw1=R*x1+T;
 xw2=R*x2+T;
 xw3=R*x3+T;
 xw4=R*x4+T;
 xw5=R*x5+T;
 
 
t01=0.238677241;
t02=0.465954214;
t11=0.235873606;
t12=0.474396034;
t21=0.232219456;
t22=0.479312124;
t31=0.217756889;
t32=0.482104059;
t41=0.221958069;
t42=0.469669584;
t51=0.228686998;
t52=0.467421172;




 syms a01
 syms a02
 a01= -1*t01 * 2*pi;
 a02=  -1*t02 * 2*pi;
 R01=[cos(a01) -sin(a01) 0;sin(a01) cos(a01) 0;0 0 1];
 R02=[cos(a02) -sin(a02) 0;sin(a02) cos(a02) 0;0 0 1];
 n01=R01*n1;                                             %光平面1扫过点0时的法矢量
 n02=R02*n2;											 %光平面2扫过点0时的法矢量

 syms a11
 syms a12
 a11= -1* t11 * 2*pi;
 a12=-1* t12 * 2*pi;
 R11=[cos(a11) -sin(a11) 0;sin(a11) cos(a11) 0;0 0 1];
 R12=[cos(a12) -sin(a12) 0;sin(a12) cos(a12) 0;0 0 1];
 n11=R11*n1;                                             %光平面1扫过点1时的法矢量
 n12=R12*n2;											 %光平面2扫过点1时的法矢量

 syms a21
 syms a22
 a21= -1* t21 * 2*pi;
 a22= -1* t22 * 2*pi;
 R21=[cos(a21) -sin(a21) 0;sin(a21) cos(a21) 0;0 0 1];
 R22=[cos(a22) -sin(a22) 0;sin(a22) cos(a22) 0;0 0 1];
 n21=R21*n1;											 %光平面1扫过点2时的法矢量
 n22=R22*n2;											 %光平面2扫过点2时的法矢量

 syms a31
 syms a32
 a31= -1* t31 * 2*pi;
 a32= -1* t32 * 2*pi;
 R31=[cos(a31) -sin(a31) 0;sin(a31) cos(a31) 0;0 0 1];
 R32=[cos(a32) -sin(a32) 0;sin(a32) cos(a32) 0;0 0 1];
 n31=R31*n1;											 %光平面1扫过点3时的法矢量
 n32=R32*n2;											 %光平面2扫过点3时的法矢量

 syms a41
 syms a42
 a41= -1* t41 * 2*pi;
 a42= -1* t42 * 2*pi;
 R41=[cos(a41) -sin(a41) 0;sin(a41) cos(a41) 0;0 0 1];
 R42=[cos(a42) -sin(a42) 0;sin(a42) cos(a42) 0;0 0 1];
 n41=R41*n1;                                             %光平面1扫过点4时的法矢量
 n42=R42*n2;											 %光平面2扫过点4时的法矢量

 syms a51
 syms a52
 a51= -1* t51 * 2*pi;
 a52= -1* t52 * 2*pi;
 R51=[cos(a51) -sin(a51) 0;sin(a51) cos(a51) 0;0 0 1];
 R52=[cos(a52) -sin(a52) 0;sin(a52) cos(a52) 0;0 0 1];
 n51=R51*n1;                                             %光平面1扫过点5时的法矢量
 n52=R52*n2;											 %光平面2扫过点5时的法矢量

  
F(1)=30*(abs(r11^2 + r12^2 + r13^2 - 1));
F(2)=r21^2 + r22^2 + r23^2 - 1;
F(3)=30*(abs(r31^2 + r32^2 + r33^2 - 1));
F(4)=r11*r12 + r21*r22 + r31*r32;
F(5)=r11*r13 + r21*r23 + r31*r33;
F(6)=r12*r13 + r22*r23 + r32*r33;
F(7)=20*(abs(r11^2 + r21^2 + r31^2 - 1));
F(8)=20*(abs(r12^2 + r22^2 + r32^2 - 1));
F(9)=r13^2 + r23^2 + r33^2 - 1;
F(10)=r11*r21 + r12*r22 + r13*r23;
F(11)=r11*r31 + r12*r32 + r13*r33;
F(12)=r21*r31 + r22*r32 + r23*r33;

F(13)=n01'*xw0;
F(14)=n02'*xw0- d;
F(15)=n11'*xw1; 
F(16)=n12'*xw1- d;
F(17)=n21'*xw2;
F(18)=n22'*xw2 -d;
F(19)=n31'*xw3;
F(20)=n32'*xw3 -d;
F(21)=n41'*xw4;
F(22)=n42'*xw4 -d;
F(23)=n51'*xw5;
F(24)=n52'*xw5 -d;


end